package com.aleksgolds.bell.integrator.autoqaengine.tests;

public class Task1 {
    /**
     * Расскажите о себе. Почему хотите заниматься автоматизированным тестированием, чего ожидаете от нового места работы:
     *
     * Автотестирование (АФТ) – работа на стыке разработки и тестирования.
     * Специалисты АФТ автоматизируют рутинные или объемные проверки функционального тестирования.
     * Они не только обладают основными навыками ФТ, но и пишут много кода на различных языках (Java, C#, Python, Scala…).
     * Этим тестировщикам не требуется настолько широко охватывать функциональность продукта, как в ФТ,
     * но зато каждый из них достаточно глубоко погружается в логику работы и реализацию того фрагмента, тестирование которого он автоматизирует.
     * В каком-то смысле работников АФТ можно назвать «программистами в тестировании»,
     * а так как я учился на именно на разработчика backend, то АФТ это вполне удобная для меня альтернатива.
     * От нового места работы ожидаю профессионального роста, интересных задач, положительных результатов.
     */
}
